Documents/Тестирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Тестирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатТестирования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тестирование/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФИОСтудентаПриИзменении(Элемент) 
	Если не Элементы.Студент.ТекстРедактирования = "" тогда	
		Студент = Объект.Студент;	
	Иначе 
		Студент = "";
	КонецЕсли;
	Объект.Группа = ПолучитьГруппу(Студент);

	
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппу(Студент)
	Результат = Справочники.Группы.НайтиПоНаименованию(Студент.Родитель.Наименование);
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		ВызватьИсключение "Не найдена группа студента
							   |Возможно группы студента нет в справочнике 'Группы'";		
	КонецЕсли;
	Возврат Результат;
КонецФункции



&НаКлиенте
Процедура ИзменениеКнопкиВитыхПар(Кнопка)
	Если Кнопка.Пометка = Истина тогда
		Цвет = Новый Цвет(255,255,255);
		Кнопка.ЦветФона = Цвет;
         	Кнопка.Пометка  = Ложь; 
	Иначе
		Цвет = Новый Цвет(255,225,0);
		Кнопка.ЦветФона = Цвет;
		Кнопка.Пометка  = Истина;						
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерваяПара(Команда, Элемент)
	ИзменениеКнопкиВитыхПар(Элементы.ПерваяПара); 
	Если НЕ ЭтаФорма.Модифицированность Тогда 
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВтораяПара(Команда)
	ИзменениеКнопкиВитыхПар(Элементы.ВтораяПара); 
	Если НЕ ЭтаФорма.Модифицированность Тогда 
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ТретьяПара(Команда)
	ИзменениеКнопкиВитыхПар(Элементы.ТретьяПара); 
	Если НЕ ЭтаФорма.Модифицированность Тогда 
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧетвертаяПара(Команда)
	ИзменениеКнопкиВитыхПар(Элементы.ЧетвертаяПара); 
	Если НЕ ЭтаФорма.Модифицированность Тогда 
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Если ЗначениеЗаполнено(Элементы.Группа.ТекстРедактирования) тогда
		Если не Элементы.Студент.ТекстРедактирования = "" тогда
			Студент = Объект.Студент;			
		Иначе 
			Студент = "";
		КонецЕсли;
		Объект.Группа = ПолучитьГруппу(Студент);		
	КонецЕсли;
	
	
	Если Элементы.ПерваяПара.Пометка = Истина тогда
		 Первая = "12";
	 Иначе
		 Первая = "    "; 
	КонецЕсли;
	Если Элементы.ВтораяПара.Пометка = Истина  тогда
		Вторая = " 34";
	Иначе
		Вторая = "    ";
	КонецЕсли;
	Если Элементы.ТретьяПара.Пометка = Истина  тогда
		Третья = " 56";
	Иначе
		Третья = "    ";
	КонецЕсли;
	Если Элементы.ЧетвертаяПара.Пометка = Истина  тогда
		Четвертая = " 78";
	Иначе
		Четвертая = "     ";
	КонецЕсли;
	
	Объект.РезультатТестирования =  "" + Первая + Вторая + Третья  + Четвертая;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Результат    = Объект.РезультатТестирования;
	МассивПар = СтрРазделить( Результат," ");
	Для Каждого эл Из МассивПар цикл
		Если эл = "12"  тогда
		 	ИзменениеКнопкиВитыхПар(Элементы.ПерваяПара);
		КонецЕсли;
		Если эл = "34"  тогда
			ИзменениеКнопкиВитыхПар(Элементы.ВтораяПара);
		КонецЕсли;
		Если эл = "56" тогда
			ИзменениеКнопкиВитыхПар(Элементы.ТретьяПара);
		КонецЕсли;
		Если  эл = "78"  тогда
			ИзменениеКнопкиВитыхПар(Элементы.ЧетвертаяПара);
		КонецЕсли;
	КонецЦикла;                                
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры
